RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pwm.c
    Cy_TCPWM_PWM_SetCompare0(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource), 0u);
    Cy_TCPWM_PWM_SetPeriod0(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource), period - 1u);

    #if defined(CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL)
    bool swapped_pins =
        (NC == pin || (_CYHAL_UTILS_GET_RESOURCE_INST(pin, cyhal_pin_map_tcpwm_line_compl, &obj->tcpwm.resource) != NULL)) &&
        (NC == pin_compl || (_CYHAL_UTILS_GET_RESOURCE_INST(pin_compl, cyhal_pin_map_tcpwm_line, &obj->tcpwm.resource) != NULL));
    #else
    CY_UNUSED_PARAMETER(pin);
    CY_UNUSED_PARAMETER(pin_compl);
    bool swapped_pins = false;
    #endif /* defined(CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL) */

    #if defined(CY_IP_MXTCPWM) && (CY_IP_MXTCPWM_VERSION >= 2)
    uint32_t pwm_ctrl_reg = TCPWM_GRP_CNT_TR_PWM_CTRL(obj->tcpwm.base, _CYHAL_TCPWM_GET_GRP(obj->tcpwm.resource.block_num),
                                _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource));
    uint32_t cc1_ignore_mask = (0 == _CYHAL_TCPWM_GET_GRP(obj->tcpwm.resource.block_num)) ?
                                0 : CY_TCPWM_PWM_MODE_CC1_IGNORE;
    bool is_center_aligned = (pwm_ctrl_reg == (CY_TCPWM_PWM_MODE_CNTR_OR_ASYMM | cc1_ignore_mask)) ||
                                (pwm_ctrl_reg == (_CYHAL_PWM_MODE_CNTR_OR_ASYMM_UO_SWAPPED | cc1_ignore_mask));
    #else
    bool is_center_aligned = (TCPWM_CNT_TR_CTRL2(obj->tcpwm.base, obj->tcpwm.resource.channel_num) == CY_TCPWM_PWM_MODE_CNTR_OR_ASYMM) ||
                                (TCPWM_CNT_TR_CTRL2(obj->tcpwm.base, obj->tcpwm.resource.channel_num) == _CYHAL_PWM_MODE_CNTR_OR_ASYMM_UO_SWAPPED);
    #endif /* CY_IP_MXTCPWM_VERSION >= 2 or other */

    uint32_t new_compare_value = (swapped_pins && !is_center_aligned)
        ? period - compare
        : compare;

    if (new_compare_value >= period)
        new_compare_value = period - 1;

    Cy_TCPWM_PWM_SetCompare0(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource), new_compare_value);
    if (Cy_TCPWM_PWM_GetCounter(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource)) >= new_compare_value)
    {
        Cy_TCPWM_PWM_SetCounter(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource), 0);
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t _cyhal_pwm_update_clock_freq(cyhal_pwm_t *obj, uint32_t period_us)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    /* If we don't own the clock, it is up to the application to pick a suitable divider.
     * If a non-zero dead time was set, the required clock is calculated to facilitate the requested
     * dead time, which does not change when we change the requested period */
    if(obj->tcpwm.dedicated_clock && false == obj->dead_time_set)
    {
        uint32_t source_hz = _cyhal_utils_get_peripheral_clock_frequency(&(obj->tcpwm.resource));
        // Pick the highest frequency that will let us achieve the requested period, for maximum granularity
        uint64_t max_period_counts = (uint64_t)((uint64_t)1u << _CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->tcpwm.resource.block_num)].max_count);
        /* Round down to make sure we err on the side of handling longer than the requested period */
        /* Conceptually this is:
         * counts_per_us = max_period_counts / period_us
         * desired_freq_hz = counts_per_us * 1e6
         * But if we break those out separately, we lose too much precision to rounding in counts_per_us
         */
        uint64_t desired_freq_hz = (uint64_t)((max_period_counts * 1e6) / period_us);

        if(desired_freq_hz > source_hz)
        {
            /* The source clock is well below that max frequency that would permit the requested period, so just
             * use the source clock as-is */
            desired_freq_hz = source_hz;
        }
        /* Always round the divider up because it's better to err on the side of a slower clock, ensuring that we can always
         * meet the requested period at the possible expense of granularity */
        uint32_t div = (uint32_t)((source_hz + (desired_freq_hz - 1))/ desired_freq_hz);
        /* When we allocate a dedicated clock divider we ask for 16-bit (or greater). For consistent behavior, always limit the frequency
         * to what a 16-bit divider can handle */
        if(div > (((uint32_t)1u) << 16)) /* Don't use UINT16_MAX. A 16-bit divider can truly support up to a 2^16 divide ratio */
        {
            div = ((uint32_t)1u) << 16;
        }
        en_clk_dst_t pclk = (en_clk_dst_t)(_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->tcpwm.resource.block_num)].clock_dst + obj->tcpwm.resource.channel_num);
        result = _cyhal_utils_peri_pclk_set_divider(pclk, &(obj->tcpwm.clock), div - 1);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->tcpwm.clock_hz = cyhal_clock_get_frequency(&obj->tcpwm.clock);
        }
    }
    return result;
}

static cy_rslt_t _cyhal_pwm_init_clock(cyhal_pwm_t *obj, uint32_t dead_time_us, const cyhal_clock_t* clk)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    en_clk_dst_t pclk = (en_clk_dst_t)(_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->tcpwm.resource.block_num)].clock_dst + obj->tcpwm.resource.channel_num);
    if (NULL != clk)
    {
        obj->tcpwm.clock = *clk;
        if (CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_assign_divider(pclk, &(obj->tcpwm.clock)))
        {
            result = CYHAL_PWM_RSLT_FAILED_CLOCK_INIT;
        }
    }
    else if (CY_RSLT_SUCCESS == (result = _cyhal_utils_allocate_clock(&obj->tcpwm.clock, &obj->tcpwm.resource, CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true)))
    {
        obj->tcpwm.dedicated_clock = true;
        uint32_t source_hz = _cyhal_utils_get_peripheral_clock_frequency(&(obj->tcpwm.resource));
        uint32_t div = 0;
        if (dead_time_us > 0)
        {
            div = (((uint64_t)source_hz * dead_time_us) / (_CYHAL_PWM_US_PER_SEC * _CYHAL_PWM_MAX_DEAD_TIME_CYCLES)) + 1;
        }
        else
        {
            div = 1; /* Will be adjusted as necessary when the period is set */
        }

        if (0 == div ||
            CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_set_divider(pclk, &(obj->tcpwm.clock), div - 1) ||
            CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_enable_divider(pclk, &(obj->tcpwm.clock)) ||
            CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_assign_divider(pclk, &(obj->tcpwm.clock)))
        {
            result = CYHAL_PWM_RSLT_FAILED_CLOCK_INIT;
        }
    }
    if (CY_RSLT_SUCCESS == result)
    {
        obj->tcpwm.clock_hz = cyhal_clock_get_frequency(&obj->tcpwm.clock);
    }

    return result;
}

static cy_rslt_t _cyhal_pwm_init_hw(cyhal_pwm_t *obj, const cy_stc_tcpwm_pwm_config_t* config, bool swapped)
{
    cy_rslt_t result = Cy_TCPWM_PWM_Init(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource), config);

    if ((swapped) && (config->pwmAlignment == CY_TCPWM_PWM_CENTER_ALIGN))
    {
        #if defined(CY_IP_MXTCPWM) && (CY_IP_MXTCPWM_VERSION >= 2)
        uint32_t cntr_asym_swapped_reg_val = (0 == TCPWM_GRP_CNT_GET_GRP(_CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource))) ?
            /* Group 0 counters does not have CC1 */
            _CYHAL_PWM_MODE_CNTR_OR_ASYMM_UO_SWAPPED :
            _CYHAL_PWM_MODE_CNTR_OR_ASYMM_UO_SWAPPED | CY_TCPWM_PWM_MODE_CC1_IGNORE;
        TCPWM_GRP_CNT_TR_PWM_CTRL(obj->tcpwm.base, TCPWM_GRP_CNT_GET_GRP(_CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource)),
                _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource)) = cntr_asym_swapped_reg_val;
        #else
        TCPWM_CNT_TR_CTRL2(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource)) = _CYHAL_PWM_MODE_CNTR_OR_ASYMM_UO_SWAPPED;
        #endif /* CY_IP_MXTCPWM_VERSION >= 2 or other */
    }

    if (CY_RSLT_SUCCESS == result)
    {
        _cyhal_tcpwm_init_data(&obj->tcpwm);
        obj->dead_time_set = (0u != config->deadTimeClocks);
        Cy_TCPWM_PWM_Enable(obj->tcpwm.base, _CYHAL_TCPWM_CNT_NUMBER(obj->tcpwm.resource));
    }

    return result;
}

cy_rslt_t cyhal_pwm_init_cfg(cyhal_pwm_t *obj, const cyhal_pwm_configurator_t *cfg)
{
    obj->tcpwm.resource = *cfg->resource;
    obj->tcpwm.base     = _CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->tcpwm.resource.block_num)].base;
    /* Pass 0 for dead time us because we can't easily calculate that, but that's okay because the
     * configurator will already have calculated assigned a clock and calculated dead time cycles for us */
    cy_rslt_t result = _cyhal_pwm_init_clock(obj, 0u, cfg->clock);

    if(CY_RSLT_SUCCESS == result)
    {
        /* Hard-code swapped to false becuase the configurator doesn't support swapping today, and if it adds support
         * for it in the future it will handle the relevant register manipulations itself */
        result = _cyhal_pwm_init_hw(obj, cfg->config, false);
    }

    if(CY_RSLT_SUCCESS != result)
    {
        cyhal_pwm_free(obj);
    }

    return result;
}


