RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_pwm.c
cy_rslt_t cyhal_pwm_init_adv(cyhal_pwm_t *obj, cyhal_gpio_t pin, cyhal_gpio_t compl_pin, cyhal_pwm_alignment_t pwm_alignment, bool continuous, uint32_t dead_time_us, bool invert, const cyhal_clock_t *clk)
{
    CY_ASSERT(NULL != obj);

    cy_rslt_t result = CY_RSLT_SUCCESS;
    memset(obj, 0, sizeof(cyhal_pwm_t));
    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    obj->tcpwm.resource.type = CYHAL_RSC_INVALID;
    obj->pin                 = CYHAL_NC_PIN_VALUE;
    obj->pin_compl           = CYHAL_NC_PIN_VALUE;

    const cyhal_resource_pin_mapping_t* map = _CYHAL_UTILS_TRY_ALLOC(pin, CYHAL_RSC_TCPWM, cyhal_pin_map_tcpwm_line);

    bool swapped = false;
    #if defined(CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL)
    if (map == NULL)
    {
        swapped = true;
        map = _CYHAL_UTILS_TRY_ALLOC(pin, CYHAL_RSC_TCPWM, cyhal_pin_map_tcpwm_line_compl);
    }
    #endif

    if (map == NULL)
    {
        result = CYHAL_PWM_RSLT_BAD_ARGUMENT;
    }
    else
    {
        _CYHAL_UTILS_ASSIGN_RESOURCE(obj->tcpwm.resource, CYHAL_RSC_TCPWM, map);
        obj->tcpwm.base     = _CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->tcpwm.resource.block_num)].base;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_utils_reserve_and_connect(map, CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE);
    }
    if (CY_RSLT_SUCCESS == result)
    {
        obj->pin = pin;
    }

    if (CY_RSLT_SUCCESS == result && NC != compl_pin)
    {
    #if defined(CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL)
        const cyhal_resource_pin_mapping_t *map_compl = swapped
            ? _cyhal_utils_get_resource(compl_pin, cyhal_pin_map_tcpwm_line,
                sizeof(cyhal_pin_map_tcpwm_line) / sizeof(cyhal_resource_pin_mapping_t), &(obj->tcpwm.resource), false)
            :
              _cyhal_utils_get_resource(compl_pin, cyhal_pin_map_tcpwm_line_compl,
                sizeof(cyhal_pin_map_tcpwm_line_compl) / sizeof(cyhal_resource_pin_mapping_t), &(obj->tcpwm.resource), false);

        if (NULL == map_compl)
        {
            result = CYHAL_PWM_RSLT_BAD_ARGUMENT;
        }
        else
        {
            result = _cyhal_utils_reserve_and_connect(map_compl, CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL);
            if (CY_RSLT_SUCCESS == result)
            {
                obj->pin_compl = compl_pin;
            }
        }
    #else
        result = CYHAL_PWM_RSLT_BAD_ARGUMENT;
    #endif /* defined(CYHAL_PIN_MAP_DRIVE_MODE_TCPWM_LINE_COMPL) */
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_pwm_init_clock(obj, dead_time_us, clk);
    }

    uint32_t pdl_alignment = CY_TCPWM_PWM_LEFT_ALIGN;
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_pwm_convert_alignment(pwm_alignment, &pdl_alignment, swapped);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        uint8_t dead_time = (uint8_t)(dead_time_us * obj->tcpwm.clock_hz / _CYHAL_PWM_US_PER_SEC);

        cy_stc_tcpwm_pwm_config_t pdl_config =
        {
            .pwmMode           = (dead_time == 0) ? CY_TCPWM_PWM_MODE_PWM : CY_TCPWM_PWM_MODE_DEADTIME,
            .clockPrescaler    = CY_TCPWM_PWM_PRESCALER_DIVBY_1,
            .pwmAlignment      = pdl_alignment,
            .deadTimeClocks    = dead_time,
            .runMode           = (continuous) ? CY_TCPWM_PWM_CONTINUOUS : CY_TCPWM_PWM_ONESHOT,
            .period0           = 0UL,
            .period1           = 0UL,
            .enablePeriodSwap  = false,
            .compare0          = 0UL,
            .compare1          = 0UL,
            .enableCompareSwap = false,
            .interruptSources  = CY_TCPWM_INT_NONE,
            .invertPWMOut      = (invert) ? CY_TCPWM_PWM_INVERT_ENABLE : CY_TCPWM_PWM_INVERT_DISABLE,
            .invertPWMOutN     = (invert) ? CY_TCPWM_PWM_INVERT_ENABLE : CY_TCPWM_PWM_INVERT_DISABLE,
            .killMode          = CY_TCPWM_PWM_STOP_ON_KILL,
            .swapInputMode     = CY_TCPWM_INPUT_RISINGEDGE,
            .swapInput         = CY_TCPWM_INPUT_0,
            .reloadInputMode   = CY_TCPWM_INPUT_RISINGEDGE,
            .reloadInput       = CY_TCPWM_INPUT_0,
            .startInputMode    = CY_TCPWM_INPUT_RISINGEDGE,
            .startInput        = CY_TCPWM_INPUT_0,
            .killInputMode     = CY_TCPWM_INPUT_RISINGEDGE,
            .killInput         = CY_TCPWM_INPUT_0,
            .countInputMode    = CY_TCPWM_INPUT_LEVEL,
            .countInput        = CY_TCPWM_INPUT_1
        };

        result = _cyhal_pwm_init_hw(obj, &pdl_config, swapped);
    }

    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_pwm_free(obj);
    }

    return result;
}

void cyhal_pwm_free(cyhal_pwm_t *obj)
{
    CY_ASSERT(NULL != obj);
    if(false == obj->tcpwm.owned_by_configurator)
    {
        _cyhal_utils_release_if_used(&obj->pin);
        _cyhal_utils_release_if_used(&obj->pin_compl);
    }

    _cyhal_tcpwm_free(&obj->tcpwm);
}

cy_rslt_t cyhal_pwm_set_period(cyhal_pwm_t *obj, uint32_t period_us, uint32_t pulse_width_us)
{
    CY_ASSERT(NULL != obj);
    cy_rslt_t result = _cyhal_pwm_update_clock_freq(obj, period_us);
    if(CY_RSLT_SUCCESS == result)
    {
        uint32_t period = (uint32_t)((uint64_t)period_us * obj->tcpwm.clock_hz / _CYHAL_PWM_US_PER_SEC);
        uint32_t width = (uint32_t)((uint64_t)pulse_width_us * obj->tcpwm.clock_hz / _CYHAL_PWM_US_PER_SEC);
        result = cyhal_pwm_set_period_and_compare(obj, period, width);
    }
    return result;
}

cy_rslt_t cyhal_pwm_set_duty_cycle(cyhal_pwm_t *obj, float duty_cycle, uint32_t frequencyhal_hz)
{
    CY_ASSERT(NULL != obj);
    if (duty_cycle < 0.0f || duty_cycle > 100.0f || frequencyhal_hz < 1)
        return CYHAL_PWM_RSLT_BAD_ARGUMENT;
    /* Always round up to make sure we wind up able to meet the requested period */
    uint32_t period_us = (_CYHAL_PWM_US_PER_SEC + (frequencyhal_hz - 1))/ frequencyhal_hz;
    cy_rslt_t result = _cyhal_pwm_update_clock_freq(obj, period_us);
    if(CY_RSLT_SUCCESS == result)
    {
        uint32_t period = (obj->tcpwm.clock_hz + (frequencyhal_hz >> 1)) / frequencyhal_hz;
        uint32_t width = (uint32_t)(duty_cycle * 0.01f * period);
        result = cyhal_pwm_set_period_and_compare(obj, period, width);
    }
    return result;
}

